# E (242) День народження Сонечки
# Всеукраїнська олімпіада з інформатики ІІ етап 2023-2024 н.р.
# https://uoi.eolymp.space/uk/problems/242
# https://www.kievoi.ippo.kubg.edu.ua/kievoi/1-2/2023.pdf
# https://oi.in.ua/wp-content/uploads/2023/12/gstdnnklefqyulnnsumu.pdf розбір
# 100%
# Сонечка — найкраща подруга Міс М. Вона вступила до найкращого університету далекої та прогресивної країни Безчаїндії. Міс М дуже сумує за подружкою, тому вирішила зробити подарунок для Сонечки, поки вона навчається в іншій країні.
#
# Сьогодні в Сонечки день народження, але Міс М ще може встигнути підготувати подарунок, оскільки має час, адже Сонечка повернеться трішки пізніше.
#
# Міс М вирішила, що хоче навчитися вишивати хрестиком і зробити орнаменти на вишиванці, яка буде подарунком для Сонечки, і подарувати, коли та повернеться. Але вона поки взагалі не знає, з чого почати. У неї з'явилася ідея написати програму, що буде робити орнамент потрібної ширини та довжини, який вона може потім використовувати як приклад для вишивки.
#
# Вишиванка — це прямокутник n×m. Орнаменти — це два промені, які виходять з верхніх кутів вишиванки та мають кути 45
# ∘
#  . Промінь відбивається, коли доторкається до вертикального краю. Коли промінь доторкається до нижнього краю — він зникає. Для кращого розуміння можете подивитися приклади.
#
# Допоможіть Міс М навчитися вишивати хрестиком та подарувати красиву вишиванку прекрасній Сонечці на день народження, написавши таку програму, яка відповідно до заданої ширини n та довжини m виведе приклад орнаменту.
#
# Вхідні дані
# Перший рядок містить два цілі числа n та m (3≤n,m≤1000) — висота та ширина відповідно.
#
# Вихідні дані
# Виведіть орнамент розмірами n×m.

m, n = map(int, input().split())
k = 0
#Variant1
for i in range(m):
    for j in range(n):
        char = '.'
        # if  i %(n-1)==0 and   j   %(n-1)==0 or \
        #  (i-1)%(n-1)==0 and ((j-1)%(n-1)==0 or(j+1)%(n-1)==0) or\
        #  (i-2)%(n-1)==0 and ((j-2)%(n-1)==0 or(j+2)%(n-1)==0) or\
        #  (i-3)%(n-1)==0 and ((j-3)%(n-1)==0 or(j+3)%(n-1)==0):
        if (i - k) % (n - 1) == 0 and (
                (j - k) % (n - 1) == 0 or (j + k) % (n - 1) == 0):
            char = 'x'
        print(char, end='')
    print()
    k += 1
    if k % (n - 1) == 0:
        k = 0

#Variant2
print()
for i in range(m):
    char=''
    for j in range(n):
        #char='.'
        # if  i %(n-1)==0 and   j   %(n-1)==0 or \
        #  (i-1)%(n-1)==0 and ((j-1)%(n-1)==0 or(j+1)%(n-1)==0) or\
        #  (i-2)%(n-1)==0 and ((j-2)%(n-1)==0 or(j+2)%(n-1)==0) or\
        #  (i-3)%(n-1)==0 and ((j-3)%(n-1)==0 or(j+3)%(n-1)==0):
        if (i-k)%(n-1)==0 and ((j-k)%(n-1)==0 or(j+k)%(n-1)==0):
            char+='x'
        else:
            char+='.'
    print(char)
    k+=1
    # if k%(n-1)==0:
    #     k=0

#Variant3 (fastest)
print()
m,n = map(int,input().split())
k=0
for i in range(m):
    char=''.rjust(n,'.')
    char=char[:i%(n-1)]+'x'+char[i%(n-1):n-1]
    char=char[:(n-k)%(n+1)-1]+'x'+char[(n-k)%(n+1):n]
    k+=1
    if k==n-1:
        k=0
    print(char)