# D. Числа
# UOI 2022. II stage. Kyiv ?

# Ліміт на час виконання 1 секунда
# Ліміт використання пам'яті 256 мегабайтів
# 50 спроб відправити цю задачу
# Дано число n. Знайдіть найменше число, яке не менше за n, у якому кожна наступна цифра перевищує
# попередню.
# Вхідні дані
# Перший рядок містить одне ціле число n (1 ≤ n ≤ 1000).
# Вихідні дані
# Виведіть одне ціле число.
# Приклади
# Нижче ви знайдете приклади вхідних даних та відповідей, які має вивести ваша програма.
# Вхідні дані №1
# 374
# Відповідь №1
# 378
# Вхідні дані №2
# 999
# Відповідь №2
# 1234
# Вхідні дані №3
# 157
# Відповідь №3
# 157

n = int(input())
isBigger=False
while True:
    arr=list(map(int,list(str(n))))
    #print(arr)
    digit=0
    for a in arr:
        #print(digit,a)
        if digit<a:
            digit=a
            isBigger=True
        else:
            isBigger=False
            break
    if isBigger:
        break
    n+=1

print (n)