# E. (348) Сакурако запізнилася
# Всеукраїнська олімпіада з інформатики ІІ етап 2024-2025 н.р.
# https://www.uoi.ua/_files/ugd/ce0a32_61f4ee06767b4355821c9a5aededcfee.pdf умова
# https://www.uoi.ua/_files/ugd/ce0a32_f68940df326c4ee2991c4794a752a8f0.pdf розбір
# https://uoi.eolymp.space/uk/problems/348
# 100%

# Ще один день у школі: ще один раз Сакурако запізнилася!
#
# Сьогодні вона проспала, і їй потрібно дістатися до школи якнайшвидше.
#
# Є n пішохідних переходів, які відокремлюють Сакурако від її школи, кожен з яких має один світлофор. Кожен світлофор або зелений, або червоний. Колір кожного світлофора змінюється кожну хвилину.
#
# Сакурако не дуже швидка, тому їй потрібно йти одну хвилину, щоб перейти один пішохідний перехід. Також вона дуже законослухняна, тому не перейде перехід, якщо світло червоне. Нарешті, вона завжди перейде вулицю, якщо світло зелене.
#
# Визначте, скільки мінімального часу потрібно Сакурако, щоб дістатися до школи.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (1≤n≤10
# 6
#  ), яке позначає кількість пішохідних переходів, які Сакурако потрібно перейти.
#
# Другий рядок містить рядок s з n символів, які представляють початковий колір кожного світлофора; кожен символ або "G" (зелений), або "R" (червоний). Перший символ позначає колір найближчого світлофора, а останній символ позначає колір найдальшого світлофора.
#
# Вихідні дані
# Виведіть в одному рядку одне ціле число, яке позначає мінімальний час, необхідний Сакурако для переходу через переходи.
#
# Приклади
# Вхідні дані #1
# 5
# RGRRG
# Відповідь #1
# 7
# Вхідні дані #2
# 10
# GGRRGRGRRG
# Відповідь #2
# 13
# Оцінювання
# Ви отримаєте щонайменше 30 балів, якщо ваше рішення працює правильно для s
# 1
# ​
#  =s
# 2
# ​
#  =⋯=s
# n−1
# ​
#  =s
# n
# ​
#  ; тобто всі кольори однакові.
#
# Ви отримаєте щонайменше 30 балів, якщо ваше рішення працює правильно для s
# i
# ​
#
# 
# =s
# i+1
# ​
#   (1≤i≤n−1); тобто всі сусідні кольори різні.


n = int(input())
s = list(input())

ans = 0
minutes = 0
for c in s:
    if c == 'G':
        if minutes % 2 == 1:
            minutes += 2
        else:
            minutes += 1


    elif c == 'R':
        if minutes % 2 == 0:
            minutes += 2
        else:
            minutes += 1

print(minutes)