n = int(input())
a = list(input().split())

ans = []
# потрібно відсортувати масив,
# для того щоб простіше визначати,
# чи поточне число є префіксом наступного.
# дані не переводимо в int!
# Треба перевірити умову чи є поточне число префіксом наступного,
# за допомогою слайсів
# якщо так, записуємо у поточну підмножину,
# якщо ні - створюємо наступну і записуємо в неї
# синтаксис python це дозволяє
# На кожному кроці циклу заносимо кожний наступний елемент в формований масив,
# (в поточну множину чи новостворену)

# сортуємо
a.sort()
# створюємо гарний масив з першою підмножиною
# і першим елементом в ній
arr = [[a[0]]]
i, j = 0, 0

for el in range(0, len(a) - 1):

    if a[el] != a[el + 1][0:len(a[el])]:
        i += 1
        j = 0
        arr.append([])
    else:
        j += 1
    arr[i].append(a[el + 1])

print(len(arr))  # кількість підмножин
for i in range(0, len(arr)):
    print(len(arr[i]))
    for j in range(0, len(arr[i])):
        print(arr[i][j], end=' ')
    print()
