# D (184) Тренування пам'яті
# Всеукраїнська олімпіада з інформатики ІІІ етап День 1 2022-2023 н.р.
# https://uoi.eolymp.space/uk/problems/184
# Василь та Петро тренують пам'ять. Для цього вони беруть масив A[1..n] із n елементів та виконують такі дії:
#
# спочатку Василь забирає собі будь-яке число з цього масиву та називає в довільному порядку всі інші елементи масиву;
#
# потім Петро робить аналогічні дії з масивом, елементи якого назвав Василь, тобто забирає собі будь-яке число з цього масиву та називає в довільному порядку всі інші елементи масиву;
#
# потім свій хід знову робить Василь;
#
# потім знову Петро;
#
# і так далі.
#
# Очевидно, що після n ходів усі елементи масиву A будуть розподілені між Василем та Петром.
#
# Розглянемо на прикладі, як відбувається тренування пам'яті. Нехай початковий масив A=[123456].
#
# Першу дію виконує Василь: [36124]. Він забрав собі число 5 та назвав у довільному порядку всі інші елементи масиву A.
#
# Далі Петро називає такий масив: [2634]. Він забрав собі число 1.
#
# Далі Василь називає такий масив: [346]. Він забрав собі число 2.
#
# Далі Петро називає такий масив: [43]. Він забрав собі число 6.
#
# Далі Василь називає такий масив: [3]. Він забрав собі число 4.
#
# Петро забирає собі останнє число 3.
#
# Отже, у Василя опинилися числа [245], а в Петра [136].
#
# Напишіть програму, яка за заданим масивом та перебігом подій з'ясує, хто які елементи забрав собі.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (2≤n≤1000) — кількість елементів у масиві A.
#
# Другий рядок містить n цілих чисел a
# 1
# ​
#  ,a
# 2
# ​
#  ,…,a
# n
# ​
#   (−10
# 9
#  ≤a
# i
# ​
#  ≤10
# 9
#  ).
#
# Кожен з наступних (n−1) рядків містить масив, який називав Василь або Петро. Гарантується, що масиви правильні, тобто кожен такий масив можна отримати з попереднього.
#
# Вихідні дані
# У першому рядку виведіть у порядку неспадання елементи, які забрав собі Василь.
#
# У другому рядку виведіть у порядку неспадання елементи, які забрав собі Петро.
#
# Приклади
# Вхідні дані #1
# 6
# 1 2 3 4 5 6
# 3 6 1 2 4
# 2 6 3 4
# 3 4 6
# 4 3
# 3
# Відповідь #1
# 2 4 5
# 1 3 6
# Вхідні дані #2
# 5
# 1 8 4 2 100
# 2 4 100 8
# 100 2 8
# 2 8
# 2
# Відповідь #2
# 1 2 100
# 4 8
# Оцінювання
# У цій задачі кожен тест оцінюється окремо. Проте також:
#
# У 22% тестів у початковому масиві A кожне ціле число від 1 до n трапляється рівно один раз.
#
# У 35% тестів n≤10.
n = int(input())
arr=[]
for i in range(n):
    arr.append(list(map(int, input().split())))
vasyl=[]
petro=[]
for i in range(0,n-1):
    number = sum(arr[i])-sum(arr[i+1])
    if i%2==0:
        vasyl.append(number)
    else:
        petro.append(number)
if n%2==0:
    petro.append(arr[n-1][0])
else:
    vasyl.append(arr[n-1][0])
vasyl.sort()
petro.sort()
for i in range(len(vasyl)):
    print(vasyl[i],end=' ')
print()
for i in range(len(petro)):
    print(petro[i],end=' ')