# F (74) Пари
# UOI 2021-2022. II stage. Kyiv ?

# https://uoi.eolymp.space/uk/problems/74
# https://www.kievoi.ippo.kubg.edu.ua/kievoi/1-2/2021.pdf умова + розбір

# 100%

# Ліміт на час виконання 1 секунда
# Ліміт використання пам'яті 256 мегабайтів
# 50 спроб відправити цю задачу
# Знайдіть кількість пар чисел (a, b) таких, що:
#  l ≤ a ≤ r;
#  l ≤ b ≤ r;
#  перша цифра a така сама, як остання цифра b;
#  перша цифра b така сама, як остання цифра a.
# Зверніть увагу, що a може бути рівним b. Пари (a, b) та (b, a) вважають різними, якщо a ≠ b.
# Вхідні дані
# Перший рядок містить два цілі числа l та r (1 ≤ l ≤ r ≤ 106
# ).
# Вихідні дані
# Виведіть одне ціле число.
# Зверніть увагу, що відповідь може не вміщатися у 32-бітні цілочисельні типи даних. Тому потрібно
# використовувати 64-бітні цілочисельні типи даних, такі як long long в C++, long в Java чи int64 в
# Pascal. У Python додаткових дій робити непотрібно.
# Оцінювання
# Рішення, які працюватимуть правильно для r≤103
# , отримають принаймні 50 балів.
# Приклади
# Нижче ви знайдете приклади вхідних даних та відповідей, які має вивести ваша програма.
# Вхідні дані №1
# 10 99
# Відповідь №1
# 81

# Опис ідеї розвʼязання
# Задача F. Пари. Давайте для кожної пари цифр (і, j) будемо зберігати t[і][j] — кількість чисел у
# проміжку, у яких перша цифра і, а остання j. Ми можемо пройтися по всім числам від l та r, знайти
# першу та останню цифру для кожного з них і збільшити відповідне число. Відповідь — сума t[і][j] ·
# t[j][і] по всім можливим (і, j).

l, r = map(int, input().split())

s = 0
t = [[0 for j in range(10)] for i in range(10)]
k = len(str(l)) - 1
for i in range(l, r + 1):
    if i >= 10 ** (k + 1):
        # print(k)
        k += 1
    t[i // 10 ** k][i % 10] += 1
    # print(i//10**k,i%10)

for i in range(10):
    for j in range(10):
        s += t[i][j] * t[j][i]
print(s)

# Variant 2
if r < 1000:
    s = 0

    for a in range(l, r + 1):
        ka = len(str(a)) - 1
        for b in range(l, r + 1):
            kb = len(str(b)) - 1

            if a % 10 == b // 10 ** kb and a // 10 ** ka == b % 10:
                print(a, b)
                s += 1

    print(s)
