# E(65) Максимум
# Всеукраїнська олімпіада з інформатики ІІ етап 2021-2022 н.р.

# https://uoi.eolymp.space/uk/problems/65
# https://archive.uoi.ua/static/uoi-2-22-1-tutorials.pdf розбір

# Є масив a довжини n+1. Проте ви його не знаєте.
# Дано масив b довжини n, де bi​≥max(ai​,ai+1​). Тобто bi​ більший або рівний максимуму з ai​ та ai+1​.
# Знайдіть максимально можливу суму чисел масиву a.
# Вхідні дані
# Перший рядок містить одне ціле число n (1≤n≤100).
# Другий рядок містить n цілих чисел b1​,b2​,…,bn​ (1≤bi​≤1000).
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.
# Приклади
# Вхідні дані №1
# 2
# 2 3
# Відповідь №1
# 7
# Вхідні дані №2
# 3
# 3 2 3
# Відповідь №2
# 10
# Вхідні дані №3
# 3
# 1 7 1
# Відповідь №3
# 4
# Замітка
# У першому прикладі масив може виглядати так [2,2,3].
# У другому прикладі масив може виглядати так [3,2,2,3].
# У третьому прикладі масив може виглядати так [1,1,1,1]. Зверніть увагу, що b2​≥max(a2​,a3​), тобто 7≥max(1,1). Зверніть увагу, що там знак ≥, а не =.
#
