# D(64) Яблука
# Всеукраїнська олімпіада з інформатики ІІ етап 2021-2022 н.р.

# https://uoi.eolymp.space/uk/problems/64
# https://archive.uoi.ua/static/uoi-2-22-1-tutorials.pdf розбір

# У Козака Вуса є нескінченна кількість зелених, жовтих та червоних яблук.
# Він буде їх виставляти в один ряд за наступним алгоритмом:
# Спочатку g зелених яблук, потім y жовтих, потім r червоних, потім y жовтих, потім g зелених, а потім все знову нескінченну кількість разів. Наприклад, якщо g=1, y=3, r=4, то перші яблука виглядатимуть так:
# GYYYRRRRYYYGGYYYRRRRYYYGGYYYRRR...
# Тобто, всі яблука можна розбити на блоки. На цьому малюнку один блок це GYYYRRRRYYYG. Зверніть увагу, що блок починається і закінчується на один й той же символ. Саме тому на першому малюнку йдуть дві G підряд попри те, що g=1.
# Знайдіть колір яблука, що знаходиться на n-ій позиції.
# Вхідні дані
# Перший рядок містить чотири цілі числа n, g, y, r (1≤n,g,y,r≤1012).
# Зверніть увагу, що числа не вміщаються у 32-бітні цілочисельні типи даних. Тому потрібно використовувати 64-бітні цілочисельні типи даних, такі як long long в C++, long в Java чи int64 в Pascal.
# Вихідні дані
# Якщо колір буде зелений, то виведіть «G».
# Якщо колір буде жовтий, то виведіть «Y».
# Якщо колір буде червоний, то виведіть «R».
# Приклади
# Вхідні дані №1
# 1 1 3 4
# Відповідь №1
# G
# Вхідні дані №2
# 2 1 3 4
# Відповідь №2
# Y
# Вхідні дані №3
# 12 1 3 4
# Відповідь №3
# G
# Вхідні дані №4
# 13 1 3 4
# Відповідь №4
# G
# Вхідні дані №5
# 20 1 3 4
# Відповідь №5
# R
# Вхідні дані №6
# 1000000000000 1 3 4
# Відповідь №6
# Y
n, g, y, r = map(int, input().split())
c = 0
# todo
block = g + y + r + y + g
if g >= n % block >= 1 or n % block == 0 or n % block > block - g:
    c = 'G'
if g + y >= n % block > g or g + y + r + y >= n % block > g + y + r:
    c = 'Y'
if g + y + r >= n % block > g + y:
    c = 'R'
print(c)
