# C(63) Коробка
# Всеукраїнська олімпіада з інформатики ІІ етап 2021-2022 н.р.

# https://uoi.eolymp.space/uk/problems/63
# https://archive.uoi.ua/static/uoi-2-22-1-tutorials.pdf розбір

# У Козака Вуса є коробка, яка може вмістити до k кілограмів включно.
# Якщо у коробці будуть речі, вага яких перевищує k кілограмів,
# то вона порветься. У нього також є п'ять м'ячів вагою
# a1​,a2​,a3​,a4​,a5​ кілограмів відповідно.
# Також відомо, що вага кожного наступного м'яча більша за попередню.
# Визначте максимальну кількість м'ячів, які можна положити у коробку так,
# що вона не порвалася.
# Вхідні дані
# Перший рядок містить одне ціле число k (1≤k≤100).
# Другий рядок містить п'ять цілих чисел a1​,a2​,a3​,a4​,a5​
# (1≤ai​≤25). Гарантується, що кожне наступне число більше за попереднє.
# Вихідні дані
# Виведіть максимальну кількість м'ячів, які можна вмістити у коробку.
# Приклади
# Вхідні дані №1
# 10
# 1 4 5 7 25
# Відповідь №1
# 3
# Вхідні дані №2
# 4
# 1 2 3 4 5
# Відповідь №2
# 2
# Вхідні дані №3
# 9
# 1 2 3 4 5
# Відповідь №3
# 3
# Замітка
# У першому прикладі перші три речі сумарно важать 10 кілограмів,
# саме стільки можна вмістити у коробку.
# У другому прикладі перші дві речі важать три кілограми.
# А три речі важать уже шість кілограмів, проте шість більше, ніж чотири.
# Тому третю річ взяти неможливо.
# У третьому прикладі перші три речі важать шість кілограмів,
# а чотири речі важать уже десять кілограмів, тобто більше, ніж дев'ять.
# Тому відповідь три.

k = int(input())
a = map(int, input().split())
c = 0
# todo
sum=0
a=list(a)
for i in range(len(a)):
 sum+=a[i]
 if sum>k:
  sum-=a[i]
  break
 c=i+1
print(c)

