# B (263) Складаємо масив
# Всеукраїнська олімпіада з інформатики ІІІ етап День 1 2023-2024 н.р.
# https://uoi.eolymp.space/uk/problems/263
# https://oi.in.ua/wp-content/uploads/2024/02/uoi24-3-1-statement-uk.pdf умова
# https://oi.in.ua/wp-content/uploads/2024/02/uoi24-3-1-tutorial.pdf розбір
# 100%

# Софія подарувала Антону масив цифр! Хоч цей масив вже був не першим, який він бачив, але менш цікавим він його не вважає. Загравшись з масивом, він не помітив, як розбив масив до такого стану, де він вже не міг відновити початковий.
#
# Він дуже засмутився, адже існує майже безліч способів скласти початковий масив. Проте, він пам'ятає цікаву властивість подарунка: ∑
#  тобто сума конкатенацій всіх пар його елементів — максимальна поміж всіх можливих масивів, що складаються з таких самих елементів, що і подарунок.
#
# Іншими словами, ми беремо всі пари позицій i і j так, щоб j було не лівіше за i (i≤j). І додаємо до суми
#
#   означає число, яке вийде якщо записати числа a і b поряд (або 10⋅a+b). Це називається конкатенацією a і b.
#
# Наприклад, якщо в Антона був масив [1,0,3], то в нього ця сума буде дорівнювати
#
#   = 11+10+13+00+03+33=70.
#
# Допоможіть Антону і виведіть масив, який має таку властивість. Якщо існує декілька відповідей, можна вивести будь-яку.
#
# Вхідні дані
# Перший рядок містить 10 цілих чисел c
#
#   відповідає кількості цифр i у початковому масиві.
#
# Гарантується, що сума всіх чисел більша за нуль.
#
# Вихідні дані
# Виведіть масив, який складається з c
#
#   елементів, і має такі самі властивості, як масив подарований Софією.
#
# Приклади
# Вхідні дані #0
# 0 0 0 0 0 2 0 0 0 0
# Відповідь #0
# 5 5
# Вхідні дані #1
# 1 0 1 1 0 0 0 0 0 0
# Відповідь #1
# 3 2 0
# Примітка
# У другому прикладі існують такі можливі масиви:
#
# [0,2,3], сума дорівнює
# a
#   = 00+02+03+22+23+33=83;
#
# [0,3,2], сума дорівнює
# a
#   = 00+03+02+33+32+22=92;
#
# [2,0,3], сума дорівнює
# a
#   = 22+20+23+00+03+33=101;
#
# [2,3,0], сума дорівнює
# a
#   = 22+23+20+33+30+00=128;
#
# [3,0,2], сума дорівнює
# a
#   = 33+30+32+00+02+22=119;
# [3,2,0], сума дорівнює
# a
#  = 33+32+30+22+20+00=137.
#

a = list(map(int,input().split()))
ans=[]
for i in range(10):
    for _ in range (a[i]):
        ans.append(i)
ans.sort(reverse=True)
s=''
for i in range(len(ans)):
    s+=str(ans[i])+" "
print (s)