#Сьогодні Петрик нарешті написав екзамен з математичного аналізу. Всього на екзамені було a легких задач та b складних, при цьому кожна складна задача важила вдвічі більше балів ніж проста.
#Петрик пам'ятає, що не зміг розв'язати рівно x легких та рівно y складних задач, а всі інші задачі він точно розв'язав правильно.
#Тепер же Петрик цікавиться, чи радіти йому успішній здачі екзамену, якщо для складання екзамену треба набрати хоча б 51% від максимальної кількості балів.
#Зверніть увагу, що, якщо Петрик отримає 50.5% балів, то екзамен вважається не зданим.

a=5
b=3
x=4
y=1
THRESHOLD=0.51

total = a+2*b
fraction = (a+2*b-x-2*y)/total
if fraction<0.51:
    print("NO")
else:
    print('YES')
