# Успішно склавши сесію, Петрик збирається відправитись автівкою до своїх батьків у Кременчук, відстань до якого від університету рівна d кілометрів.
# Машина Петрика не є новою, тому споживає цілих w літрів бензину кожен кілометр дороги. По дорозі до рідної домівки розміщено n заправок, кожна з яких пропонує пальне за ci​ гривень за літр та розміщена на відстані xi​ кілометрів від точки відправлення. Проте, на подив, кожна заправка пропонує свій унікальний вид бензину, які змішувати між собою в баку не можна.
# Перед поїздкою Петрик хоче замінити розмір бака для пального, проте не знає на який саме. Допоможіть Петрику визначити мінімальний розмір бака для пального такий, що вартість дороги до родичів буде мінімальною. Тобто першочергово слід мінімізувати затрати на пальне.
# Гарантується, що початково бак пустий та існує таке i, що xi=0.

d = 10  # distance
w = 10  # gaz per km
n = 4  # gas stations
c = [3, 4, 2, 1]  # price
x = [0, 1, 2, 9]  # distance to gas station

x_prev = x[0]
gas = w * x[1]
size = gas
min_size = size
price = gas * c[0]
print(size, min_size, x_prev)

for i in range(1, n):
    if c[i - 1] < c[i]:
        if i < n - 1:
            size += (x[i + 1] - x[i]) * w
        else:
            size += (d - x[i]) * w
        if size > min_size:
            min_size = size

    else:
        x_prev = x[i]
        if i < n - 1:
            size = (x[i + 1] - x[i]) * w
        else:
            size = (d - x_prev) * w
        if size > min_size:
            min_size = size
print(min_size)
