# Кількість чисел Мерсенна

# Числом Мерсенна називається таке число, яке дорівнює 2^n−1
#  , де n - натуральне число.#
# Дано масив цілих чисел, підрахувати в ньому кількість чисел Мерсенна.

# Вхідні дані
# У першому рядку записано число k - кількість чисел у масиві, у наступному рядку записані самі числа a
# a1, a2, ...ak, 0 <k <1000, ( 0 ≤ai<2^31).

# Вихідні дані
# Вивести одне число – кількість чисел Мерсенна у заданому масиві.
n = int(input())
a=list(map(int, input().split()))
m=0
for i in range(len(a)):
    k=a[i]+1
    isMersen=True
    while True:

        if k%2!=0:
            isMersen=False
            break
        if k/2==1:
            m+=1
            break
        k = k / 2
print (m)