# G. (25) Одновимірний морський бій
# Всеукраїнська олімпіада з інформатики ІІ етап (Kharkiv) 2022-2023 н.р.

# https://uoi.eolymp.space/uk/problems/25

# Обмеження на час виконання 0,2 секунди
# Обмеження на використання пам'яті 64 мегабайти
# Під час проведення олімпіад з програмування журі не знає, чим себе зайняти, тому що усі рішення учасників автоматично перевіряються тестуючою системою. Від «нема чого робити» журі грають в онлайн ігри. Наприклад, на цій олімпіаді ми будемо грати онлайн в одновимірний морський бій, а для вас буде завдання − розмістити кораблі для цієї гри на полі 1×N.
#
# Напишіть програму, яка знайде таке максимальне k, що на полі 1×N можна розставити один корабель розміру 1×k, два кораблі розміру 1×(k−1), …, k кораблів розміру 1×1, причому кораблі, як і у звичайному морському бою, не повинні торкатися один одного і перетинатися.
#
# Вхідні дані
# На вхід вашій програмі подається одне натуральне число N − розмір поля для гри в одновимірний морський бій (0≤N≤10^18 ).
#
# Вихідні дані
# Виведіть одне число − таке максимальне k, що на заданому полі можна розставити усі кораблі, які зазначені в умові.
#
# Приклади
# Вхідні дані #1
# 7
# Відповідь #1
# 2
# Вхідні дані #2
# 1000
# Відповідь #2
# 16

# Вхідні дані #2+
# 274
# Відповідь #2+
# 10
# Вхідні дані #2++
# 273
# Відповідь #2++
# 9

# 92% completed
def cells(k):
    return round(k * (k + 1) * k / 2 - (k - 1) * k * (2 * k - 1) / 6 + k - 1)

a = [0, 1, 5, 6, 14,15,28,29, 48,49, 273, 274, 166676666749998, 166676666749999, 682705067200000,682705067200001, 375308558794750,375308558794751,375317148925950, 375317148925951, 375325739188224,375325739188225]
for n in a:
    # n = int(input())
    k = 0
    if n > 0:
        k = n // 2 + 1
    supr = k
    inf = 0

    while k > 0:
        # print(k)

        if cells(round(k)) > n:
            if cells(round(k) - 1) <= n:
                k = round(k) - 1
                break
            supr = k
            k = inf + (k - inf) // 2
        else:
            if cells(round(k)) < n:
                if cells(round(k) + 1) > n:
                    k = round(k)
                    break
                else:
                    if cells(round(k) + 1) == n:
                        k = round(k) + 1
                        break
                inf = k
                k = k + (supr - k) // 2
            else:
                k = round(k)
                break

        # if cells(round(k + 1)) > n and cells(round(k)) <= n:
        #     k = round(k)
        #     break
        # if cells(round(k - 1)) <= n and cells(round(k)) > n:
        #     k = round(k - 1)
        #     break

    print(round(k))
