# C. (264) Всі полюбляють перестановки
# Всеукраїнська олімпіада з інформатики ІІІ етап День 1 2023-2024 н.р.
# https://uoi.eolymp.space/uk/problems/264
# Перестановка довжини n — масив довжини n, що містить всі значення від 1 до n, і всі елементи якого попарно різні.
#
# Подорослішавши й награвшись з масивом, Антон перейшов до вивчення цікавіших масивів — перестановок. Під час написання дипломної роботи перед ним постала дуже складна задача.
#
# У нього є перестановка p довжини n та ціле число k. Він вирішив побудувати двовимірний масив a з розмірами (k+1)×n.
#
# a
# 0j
# ​
#  =j для всіх j (1≤j≤n);
#
# a
# ij
# ​
#  =a
# (i−1)p
# j
# ​
#
# ​
#   для всіх i (1≤i≤k) та j (1≤j≤n).
#
# Нехай p=[5,3,1,4,2] та k=3, тоді маємо наступний масив.
#
# a
# ij
# ​
#
#
# j=1
#
# j=2
#
# j=3
#
# j=4
#
# j=5
#
# i=0
#
# 1
#
# 2
#
# 3
#
# 4
#
# 5
#
# i=1
#
# 5
#
# 3
#
# 1
#
# 4
#
# 2
#
# i=2
#
# 2
#
# 1
#
# 5
#
# 4
#
# 3
#
# i=3
#
# 3
#
# 5
#
# 2
#
# 4
#
# 1
#
# Для кожного x (1≤x≤n) він хоче знати суму усіх j таких, що a
# ij
# ​
#  =x, де 1≤i≤k. Іншими словами, він хоче знайти суму k чисел — індексів числа x у кожному a
# i
# ​
#  .
#
# Розглянемо останній приклад. Якщо x=1, то відповідь буде 3+2+5=10.
#
# Після обмірковувань і нескладних ідей, Антон впорався розв'язати цю задачу швидко. Тепер він хоче перевірити чи впораєтесь Ви розв'язати її.
#
# Вхідні дані
# Перший рядок вхідних даних містить два цілі числа n, k (1≤n≤10
# 6
#  , 1≤k≤10
# 9
#  ) — довжина перестановки та кількість повторювань операцій відповідно.
#
# Другий рядок містить в собі перестановку p (1≤p
# i
# ​
#  ≤n).
#
# Вихідні дані
# Виведіть n цілих чисел, де i-те число — це відповідь для x=i.
#
# Приклади
# Вхідні дані #0
# 3 2
# 2 1 3
# Відповідь #0
# 3 3 6
# Вхідні дані #1
# 5 3
# 5 3 1 4 2
# Відповідь #1
# 10 9 8 12 6
# Оцінювання
# (8 балів): k=1;
#
# (17 балів): p
# i
# ​
#  =i;
#
# (26 балів): n≤2000,k≤2000;
#
# (28 балів): n≤2000, для будь-яких i та j існує таке k, що p[p[p…p[i]…]]=j, де таке вкладення береться k разів;
#
# (9 балів): для будь-яких i та j існує таке k, що p[p[p…p[i]…]]=j, де таке вкладення береться k разів;
#
# (12 балів): без додаткових обмежень.
n, k = map(int, input().split())
p = list(map(int, input().split()))
a = []
if k == 1:
    d = {p[i]: i + 1 for i in range(n)}

    s = [d[i] for i in range(1, n + 1)]
    print(' '.join(map(str, s)))

if k != 1:
    a = [i for i in range(1, n + 1)]
if a == p and k > 1:
    print(' '.join([str(k * i) for i in range(1, n + 1)]))
