# A. (262) Магазини
# Всеукраїнська олімпіада з інформатики ІІІ етап День 1 2023-2024 н.р.
# https://uoi.eolymp.space/uk/problems/262
# Сьогодні п'ятниця. Антон нарешті вільний від школи на два дні! Антон може піти додому двома шляхами:
#
# проходячи по першому шляху, Антон може відвідати a магазинів;
#
# проходячи по другому шляху, Антон може відвідати b магазинів.
#
# Також Антон знає, що є c магазинів, які зустрічаються на обох шляхах (і там, і там). Антону цікаво, скільки всього магазинів у його місті? Припускаємо, що крім цих магазинів більше у місті магазинів немає.
#
# Допоможіть йому відповісти на це запитання.
#
#
# Вище наведено один з можливих варіантів маршрутів у другому прикладі.
#
# Вхідні дані
# Перший рядок містить три цілі числа a, b, c (0≤c≤a,b≤100) — кількість магазинів на першому шляху, другому шляху та на обох.
#
# Вихідні дані
# Виведіть одне ціле число — загальну кількість магазинів у місті.
#
# Приклади
# Вхідні дані #0
# 1 2 0
# Відповідь #0
# 3
# Вхідні дані #1
# 9 6 3
# Відповідь #1
# 12
a,b,c = map(int,input().split())
ans=a-c+b
print (ans)
