# Дано шахівниця розміром n×m. Тобто з n рядками та m стовпчиками.
# У цій шахівниці є лише одна фігура — тура.
# Вона знаходиться у нижньому лівому куті. Більше ніяких фігур немає.
# Нагадаємо, що тура за один хід може переміститися на будь-яку кількість
# клітин по горизонталі або вертикалі, але не по діагоналі.
# Знайдіть кількість клітин, на які тура може переміститися за один хід.
#
# На малюнку зображена традиційна шахівниця розміру 8×8.
# У ній тура може переміститися на всі клітини, які помічені зеленим.
# Таких всього 14, тому відповідь 14.
# Вхідні дані
# Перший рядок містить два цілі числа n та m (1≤n,m≤20) — розміри шахівниці.
# Вихідні дані
# Виведіть кількість клітин, на які тура може переміститися за один хід.

n, m = map(int, input().split())
c = 0
# todo
c=(n-1)+(m-1)
print(c)
